Revit 2027 API
Connector.IsMovable Property
whether the connector can be moved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMovable { get; }
Public ReadOnly Property IsMovable As Boolean
	Get
public:
property bool IsMovable {
	bool get ();
}
member IsMovable : bool with get
Property Value
Boolean
Remarks
Only connectors of type EndConn can be moved.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace